Catalogs/ИСМППрисоединенныеФайлы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ИСМППрисоединенныеФайлы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Автор - пользователь, добавивший файл</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПользователиИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецФайла</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументыИСМП</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаМодификацииУниверсальная</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Comment>Дата добавления файла в базу</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Зашифрован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Comment>Автор - пользователь, добавивший файл</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПользователиИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндексКартинки</Name>
					<Comment>Индекс иконки, соответствующей расширению файла, для показа в списке</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Comment>Описание файла</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлу</Name>
					<Comment>Дополнительный путь к файлу на диске (в случае если тип хранения файла - на диске)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Размер</Name>
					<Comment>Размер файла</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расширение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Редактирует</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПользователиИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусИзвлеченияТекста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыИзвлеченияТекстаФайлов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстХранилище</Name>
					<Comment>Текст, извлеченный из файла - для полнотекстового поиска</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипХраненияФайла</Name>
					<Comment>Где хранятся файлы - в базе как ХранилищеЗначения или в каталоге на диске</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыХраненияФайлов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Том</Name>
					<Comment>Ссылка на том (в случае если тип хранения файла - на диске)</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ТомаХраненияФайловИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлХранилище</Name>
					<Comment>Служебное поле для обмена файлами в РИБ</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийИСМП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСообщения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗапросовИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписанЭП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешСумма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЗапроса</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументыИСМП</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СообщениеОснование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИСМППрисоединенныеФайлы</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусОбработки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОбработкиСообщенийИСМП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранитьВерсии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаема</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonForms/ЛогОбменаИСМП/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Параметры.Источник) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПоИсточнику(Параметры.Источник);
	
	Если ЗначениеЗаполнено(Параметры.Заголовок) Тогда
		АвтоЗаголовок = Ложь;
		Заголовок = Параметры.Заголовок;
	КонецЕсли;
	
	ОбщегоНазначенияСобытияФормИСПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЭтапыОбмена

&НаКлиенте
Процедура ЭтапыОбменаПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ЭтапыОбмена.ТекущиеДанные;
	
	Если (ТекущиеДанные = Неопределено) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстовыйДокумент.Очистить();
	ТекстовыйДокумент.ДобавитьСтроку(ТекущиеДанные.Запрос);
	ТекстовыйДокумент.ДобавитьСтроку(ТекущиеДанные.ЗапросЗаголовки);
	Если Не ПустаяСтрока(ТекущиеДанные.ЗапросТело) Тогда
		ТекстовыйДокумент.ДобавитьСтроку(ТекущиеДанные.ЗапросТело);
	КонецЕсли;
	
	ТекстовыйДокумент.ДобавитьСтроку("");
	Если Не ПустаяСтрока(ТекущиеДанные.ОтветЗаголовки) Тогда
		ТекстовыйДокумент.ДобавитьСтроку(ТекущиеДанные.ОтветЗаголовки);
	КонецЕсли;
	Если Не ПустаяСтрока(ТекущиеДанные.ОтветТело) Тогда
		ТекстовыйДокумент.ДобавитьСтроку(ТекущиеДанные.ОтветТело);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьПротоколВФайл(Команда)
	
	ИмяФайла = СтрШаблон(
		НСтр("ru = 'Лог запросов из протокола по документу %1.txt'"),
		Документ);
	ИмяФайла = СтрЗаменить(ИмяФайла, ":", "-");
	
	ДиалогВыбораФайла                = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогВыбораФайла.Фильтр         = "*.txt|*.txt";
	ДиалогВыбораФайла.ПолноеИмяФайла = ИмяФайла;
	
	ОповещениеВыбораФайла = Новый ОписаниеОповещения("ВыборФайлаЗавершение", ЭтотОбъект);
	
	ДиалогВыбораФайла.Показать(ОповещениеВыбораФайла);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОписанияОповещений

&НаКлиенте
Процедура ВыборФайлаЗавершение(ПутиКФайлам, ДополнительныеПараметры) Экспорт
	
	Если ПутиКФайлам = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СохраняемыйДокумент = Новый ТекстовыйДокумент();
	
	СохраняемыйДокумент.ДобавитьСтроку(
		СтрШаблон(
			НСтр("ru = 'Лог запросов из протокола по документу: %1'"),
			Документ));
			
	Для Каждого СтрокаДанных Из ЭтапыОбмена Цикл
		
		СохраняемыйДокумент.ДобавитьСтроку(СтрокаДанных.Запрос);
		СохраняемыйДокумент.ДобавитьСтроку(СтрокаДанных.ЗапросЗаголовки);
		Если Не ПустаяСтрока(СтрокаДанных.ЗапросТело) Тогда
			СохраняемыйДокумент.ДобавитьСтроку(СтрокаДанных.ЗапросТело);
		КонецЕсли;
		
		СохраняемыйДокумент.ДобавитьСтроку("");
		Если Не ПустаяСтрока(СтрокаДанных.ОтветЗаголовки) Тогда
			СохраняемыйДокумент.ДобавитьСтроку(СтрокаДанных.ОтветЗаголовки);
		КонецЕсли;
		Если Не ПустаяСтрока(СтрокаДанных.ОтветТело) Тогда
			СохраняемыйДокумент.ДобавитьСтроку(СтрокаДанных.ОтветТело);
		КонецЕсли;
		
	КонецЦикла;
	
	СохраняемыйДокумент.ДобавитьСтроку("");
	СохраняемыйДокумент.ДобавитьСтроку(ИнформацияОбОкружении());
	
	Попытка
		СохраняемыйДокумент.Записать(ПутиКФайлам[0],, Символы.ПС);
	Исключение
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ПоказатьПредупреждение(,
			СтрШаблон(
				НСтр("ru = 'Ошибка сохранения файла:
					       |%1'"),
				КраткоеПредставлениеОшибки(ИнформацияОбОшибке)));
		Возврат;
		
	КонецПопытки;
	
	ПоказатьОповещениеПользователя(
		СтрШаблон(
			НСтр("ru = 'Файл сохранен по пути: %1'"),
			ПутиКФайлам[0]));
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ЗаполнитьПоИсточнику(Источник)
	
	ПротоколОбмена = Неопределено;
	
	Если ТипЗнч(Источник) = Тип("Строка") Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ОчередьСообщенийИСМП.ДатаСоздания                 КАК ДатаСоздания,
		|	ОчередьСообщенийИСМП.Документ                     КАК Документ,
		|	ОчередьСообщенийИСМП.Операция                     КАК Операция,
		|	ОчередьСообщенийИСМП.ПротоколОбмена               КАК ПротоколОбмена,
		|	ОчередьСообщенийИСМП.РеквизитыИсходящегоСообщения КАК РеквизитыИсходящегоСообщения,
		|	ОчередьСообщенийИСМП.ИдентификаторЗаявки          КАК ИдентификаторЗапроса
		|ИЗ
		|	РегистрСведений.ОчередьСообщенийИСМП              КАК ОчередьСообщенийИСМП
		|ГДЕ
		|	ОчередьСообщенийИСМП.Сообщение = &Сообщение");
		Запрос.УстановитьПараметр("Сообщение", Источник);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка, "ДатаСоздания, Документ, Операция, ИдентификаторЗапроса");
			ПротоколОбмена = Выборка.ПротоколОбмена.Получить();
			
			Если ПротоколОбмена = Неопределено Тогда
				РеквизитыСообщения = Выборка.РеквизитыИсходящегоСообщения.Получить();
				
				ПротоколОбмена = Новый Массив;
				
				СтрокаПротокола = Новый Структура;
				СтрокаПротокола.Вставить("ЗапросТело",        РеквизитыСообщения.ТекстСообщенияJSON);
				СтрокаПротокола.Вставить("ОтветТело",         "");
				СтрокаПротокола.Вставить("Операция",          Выборка.Операция);
				СтрокаПротокола.Вставить("ДатаУниверсальная", Выборка.ДатаСоздания);
				
				ПротоколОбмена.Добавить(СтрокаПротокола);
				
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Источник) = Тип("Структура") Тогда
		
		ПротоколОбмена = ОбщегоНазначения.ЗначениеИзСтрокиXML(Источник.ПротоколОбменаXML);
		
	Иначе
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ИСМППрисоединенныеФайлы.ДатаСоздания         КАК ДатаСоздания,
		|	ИСМППрисоединенныеФайлы.Документ             КАК Документ,
		|	ИСМППрисоединенныеФайлы.Операция             КАК Операция,
		|	ИСМППрисоединенныеФайлы.Описание             КАК Ошибка,
		|	ИСМППрисоединенныеФайлы.ФорматОбмена         КАК ФорматОбмена,
		|	ИСМППрисоединенныеФайлы.ИдентификаторЗапроса КАК ИдентификаторЗапроса
		|ИЗ
		|	Справочник.ИСМППрисоединенныеФайлы КАК ИСМППрисоединенныеФайлы
		|ГДЕ
		|	ИСМППрисоединенныеФайлы.Ссылка = &Сообщение");
		
		Запрос.УстановитьПараметр("Сообщение", Источник);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка, "ДатаСоздания, Документ, Операция, ИдентификаторЗапроса");
			ПротоколОбмена = ОбщегоНазначения.ЗначениеИзСтрокиXML(
				ПротоколОбменаИС.ТекстСообщенияXMLИзПротокола(Источник))
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПротоколОбмена = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		Для Каждого ЭлементДанных Из ПротоколОбмена Цикл
			
			СтрокаТЧ = ЭтапыОбмена.Добавить();
			
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, ЭлементДанных);
			СтрокаТЧ.Дата = ЭлементДанных.ДатаУниверсальная + (ТекущаяДатаСеанса() - ТекущаяУниверсальнаяДата());
			
			Если Лев(НРег(СокрЛП(ЭлементДанных.ЗапросТело)), 5) = "<?xml" Тогда
				ОбъектXDTO = ОбщегоНазначения.ОбъектXDTOИзСтрокиXML(ЭлементДанных.ЗапросТело);
				Если ОбъектXDTO <> Неопределено Тогда
					СтрокаТЧ.ЗапросТело = ОбщегоНазначенияИСМП.ОбъектXDTOВXML(ОбъектXDTO,, Истина);
				Иначе
					СтрокаТЧ.ЗапросТело = ЭлементДанных.ЗапросТело;
				КонецЕсли;
			Иначе
				ОбъектJSON = ОбщегоНазначенияИСМП.ТекстJSONВОбъект(ЭлементДанных.ЗапросТело, Истина);
				Если ОбъектJSON <> Неопределено Тогда
					СтрокаТЧ.ЗапросТело = ОбщегоНазначенияИСМП.ОбъектВТекстJSON(ОбъектJSON);
				Иначе
					СтрокаТЧ.ЗапросТело = ЭлементДанных.ЗапросТело;
				КонецЕсли;
			КонецЕсли;
			
			ОбъектJSON = ОбщегоНазначенияИСМП.ТекстJSONВОбъект(ЭлементДанных.ОтветТело, Истина);
			Если ОбъектJSON <> Неопределено Тогда
				СтрокаТЧ.ОтветТело = ОбщегоНазначенияИСМП.ОбъектВТекстJSON(ОбъектJSON);
			Иначе
				СтрокаТЧ.ОтветТело = ЭлементДанных.ОтветТело;
			КонецЕсли;
			
		КонецЦикла;
	Исключение
		ЭтапыОбмена.Очистить();
	КонецПопытки;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИнформацияОбОкружении()
	Возврат ЛогированиеЗапросовИСМП.ИнформацияОбОкружении();
КонецФункции

#КонецОбласти
